Power-Law/wedge_needles/temperature/35_temp/90_needle_layer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          59;
        startFace       125014;
    }
    outlet
    {
        type            patch;
        nFaces          59;
        startFace       125073;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1069;
        startFace       125132;
    }
    wedge1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          63071;
        startFace       126201;
    }
    wedge2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          63071;
        startFace       189272;
    }
)

// ************************************************************************* //
